      ******************************************************************
      * Author: Luca Morgado (mkarten)
      * Date: 04-MAY-2022
      * Purpose: Game
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
      *-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
       PROGRAM-ID. HIGHER-OR-LOWER.
       AUTHOR. LUCA MORGADO.
       DATE-WRITTEN. 04-MAY-2022.
       DATE-COMPILED. 04-MAY-2022.
       SECURITY. OpenSource.
       ENVIRONMENT DIVISION.
      *-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
       CONFIGURATION SECTION.
      *-----------------------
       INPUT-OUTPUT SECTION.
      *-----------------------
       DATA DIVISION.
      *-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
       FILE SECTION.
      *-----------------------
       WORKING-STORAGE SECTION.
      *-----------------------
       PROCEDURE DIVISION.
      *-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
       MAIN-PROCEDURE.
            STOP RUN.
       END PROGRAM HIGHER-OR-LOWER.
